This is a draft

In [1]:
import pandas as pd

# Email Analysis

In [26]:
emails = pd.read_pickle("data/emails.pickle")[["email"]]

In [8]:
def get_domain(x):
    pos = x.find("@")
    return x[(pos+1):] if (0 <= pos) else False

In [29]:
emails["domains"] = emails.email.apply(get_domain)

In [45]:
emails.domains.value_counts().head()

enron.com            29333
aol.com               3016
hotmail.com           1804
yahoo.com             1258
haas.berkeley.edu      648
Name: domains, dtype: int64

In [35]:
rs = pd.read_pickle("data/recipients.pickle")

In [39]:
rs.head()

      m_id   e_id type
r_id
67      52  17675   TO
68      53  17676   TO
69      54  17677   TO
70      55  17675   TO
71      56  17678   TO

In [46]:
rs[["m_id", "e_id"]].groupby("e_id").count().sort_values("m_id", ascending = False).join(emails).head()

       m_id                      email    domains
e_id
73    11094    jeff.dasovich@enron.com  enron.com
225   10844  richard.shapiro@enron.com  enron.com
260   10803    steven.j.kean@enron.com  enron.com
61    10518  james.d.steffes@enron.com  enron.com
457    9813       no.address@enron.com  enron.com

In [47]:
ms = pd.read_pickle("data/messages.pickle")

In [53]:
ms.head(1)

,e_id,date,subject,body,folder
m_id,,,,,
52,297,2000-01-21 04:51:00,ENRON HOSTS ANNUAL ANALYST CONFERENCE PROVIDES...,HOUSTON - Enron Corp. hosted its annual equity...,Robert_Badeer_Aug2000Notes FoldersPress releases

In [64]:
ms.groupby("e_id").count()[["date"]].sort_values("date", ascending = False).join(emails).head()

      date                      email    domains
e_id
73    6273    jeff.dasovich@enron.com  enron.com
292   5838       j.kaminski@enron.com  enron.com
15    5100         kay.mann@enron.com  enron.com
241   4797  sara.shackleton@enron.com  enron.com
277   4437       tana.jones@enron.com  enron.com